rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_SCG.h
/*
** ###################################################################
**     Processor:           S32M24x
**     Compiler:            Keil ARM C/C++ Compiler
**     Reference manual:    S32M24x RM Rev.4
**     Version:             rev. 1.5, 2024-08-01
**     Build:               b240801
**
**     Abstract:
**         Peripheral Access Layer for S32M24x
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2024 NXP
**
**     NXP Confidential and Proprietary. This software is owned or controlled
**     by NXP and may only be used strictly in accordance with the applicable
**     license terms. By expressly accepting such terms or by downloading,
**     installing, activating and/or otherwise using the software, you are
**     agreeing that you have read, and that you agree to comply with and are
**     bound by, such license terms. If you do not agree to be bound by the
**     applicable license terms, then you may not retain, install, activate
**     or otherwise use the software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32M24x_SCG.h
 * @version 1.5
 * @date 2024-08-01
 * @brief Peripheral Access Layer for S32M24x_SCG
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
 * @page misra_violations MISRA-C:2012 violations
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
 * The SoC header defines typedef for all modules.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
 * The SoC header defines macros for all modules and registers.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
 * These are generated macros used for accessing the bit-fields from registers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.1, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.2, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.4, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 5.5, identifier clash
 * The supported compilers use more than 31 significant characters for identifiers.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
 * This type qualifier is needed to ensure correct I/O access and addressing.
 */

/* Prevention from multiple including the same memory map */
#if !defined(S32M24x_SCG_H_) /* Check if memory map has not been already included */
#define S32M24x_SCG_H_

#include "S32M24x_COMMON.h"

/* ----------------------------------------------------------------------------
   -- SCG Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SCG_Peripheral_Access_Layer SCG Peripheral Access Layer
 * @{
 */

/** SCG - Register Layout Typedef */
typedef struct {
    __I uint32_t VERID; /**< Version ID Register, offset: 0x0 */
    __I uint32_t PARAM; /**< Parameter Register, offset: 0x4 */
    uint8_t RESERVED_0[8];
    __I uint32_t CSR;   /**< Clock Status Register, offset: 0x10 */
    __IO uint32_t RCCR; /**< Run Clock Control Register, offset: 0x14 */
    __IO uint32_t VCCR; /**< VLPR Clock Control Register, offset: 0x18 */
    uint8_t RESERVED_1[4];
    __IO uint32_t CLKOUTCNFG; /**< SCG CLKOUT Configuration Register, offset: 0x20 */
    uint8_t RESERVED_2[220];
    __IO uint32_t SOSCCSR; /**< System OSC Control Status Register, offset: 0x100 */
    __IO uint32_t SOSCDIV; /**< System OSC Divide Register, offset: 0x104 */
    __IO uint32_t SOSCCFG; /**< System Oscillator Configuration Register, offset: 0x108 */
    uint8_t RESERVED_3[244];
    __IO uint32_t SIRCCSR; /**< Slow IRC Control Status Register, offset: 0x200 */
    __IO uint32_t SIRCDIV; /**< Slow IRC Divide Register, offset: 0x204 */
    __IO uint32_t SIRCCFG; /**< Slow IRC Configuration Register, offset: 0x208 */
    uint8_t RESERVED_4[244];
    __IO uint32_t FIRCCSR; /**< Fast IRC Control Status Register, offset: 0x300 */
    __IO uint32_t FIRCDIV; /**< Fast IRC Divide Register, offset: 0x304 */
    __IO uint32_t FIRCCFG; /**< Fast IRC Configuration Register, offset: 0x308 */
    uint8_t RESERVED_5[756];
    __IO uint32_t SPLLCSR; /**< System PLL Control Status Register, offset: 0x600 */
    __IO uint32_t SPLLDIV; /**< System PLL Divide Register, offset: 0x604 */
    __IO uint32_t SPLLCFG; /**< System PLL Configuration Register, offset: 0x608 */
} SCG_Type, *SCG_MemMapPtr;

/** Number of instances of the SCG module. */
#define SCG_INSTANCE_COUNT (1u)

/* SCG - Peripheral instance base addresses */
/** Peripheral SCG base address */
#define IP_SCG_BASE (0x40064000u)
/** Peripheral SCG base pointer */
#define IP_SCG ((SCG_Type*)IP_SCG_BASE)
/** Array initializer of SCG peripheral base addresses */
#define IP_SCG_BASE_ADDRS                                                                          \
    {                                                                                              \
        IP_SCG_BASE                                                                                \
    }
/** Array initializer of SCG peripheral base pointers */
#define IP_SCG_BASE_PTRS                                                                           \
    {                                                                                              \
        IP_SCG                                                                                     \
    }

/* ----------------------------------------------------------------------------
   -- SCG Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SCG_Register_Masks SCG Register Masks
 * @{
 */

