rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_SCG.h
/*! @name VERID - Version ID Register */
/*! @{ */

#define SCG_VERID_VERSION_MASK (0xFFFFFFFFU)
#define SCG_VERID_VERSION_SHIFT (0U)
#define SCG_VERID_VERSION_WIDTH (32U)
#define SCG_VERID_VERSION(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << SCG_VERID_VERSION_SHIFT)) & SCG_VERID_VERSION_MASK)
/*! @} */

/*! @name PARAM - Parameter Register */
/*! @{ */

#define SCG_PARAM_CLKPRES_MASK (0xFFU)
#define SCG_PARAM_CLKPRES_SHIFT (0U)
#define SCG_PARAM_CLKPRES_WIDTH (8U)
#define SCG_PARAM_CLKPRES(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << SCG_PARAM_CLKPRES_SHIFT)) & SCG_PARAM_CLKPRES_MASK)

#define SCG_PARAM_DIVPRES_MASK (0xF8000000U)
#define SCG_PARAM_DIVPRES_SHIFT (27U)
#define SCG_PARAM_DIVPRES_WIDTH (5U)
#define SCG_PARAM_DIVPRES(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << SCG_PARAM_DIVPRES_SHIFT)) & SCG_PARAM_DIVPRES_MASK)
/*! @} */

/*! @name CSR - Clock Status Register */
/*! @{ */

#define SCG_CSR_DIVSLOW_MASK (0xFU)
#define SCG_CSR_DIVSLOW_SHIFT (0U)
#define SCG_CSR_DIVSLOW_WIDTH (4U)
#define SCG_CSR_DIVSLOW(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << SCG_CSR_DIVSLOW_SHIFT)) & SCG_CSR_DIVSLOW_MASK)

#define SCG_CSR_DIVBUS_MASK (0xF0U)
#define SCG_CSR_DIVBUS_SHIFT (4U)
#define SCG_CSR_DIVBUS_WIDTH (4U)
#define SCG_CSR_DIVBUS(x)                                                                          \
    (((uint32_t)(((uint32_t)(x)) << SCG_CSR_DIVBUS_SHIFT)) & SCG_CSR_DIVBUS_MASK)

#define SCG_CSR_DIVCORE_MASK (0xF0000U)
#define SCG_CSR_DIVCORE_SHIFT (16U)
#define SCG_CSR_DIVCORE_WIDTH (4U)
#define SCG_CSR_DIVCORE(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << SCG_CSR_DIVCORE_SHIFT)) & SCG_CSR_DIVCORE_MASK)

#define SCG_CSR_SCS_MASK (0xF000000U)
#define SCG_CSR_SCS_SHIFT (24U)
#define SCG_CSR_SCS_WIDTH (4U)
#define SCG_CSR_SCS(x) (((uint32_t)(((uint32_t)(x)) << SCG_CSR_SCS_SHIFT)) & SCG_CSR_SCS_MASK)
/*! @} */

/*! @name RCCR - Run Clock Control Register */
/*! @{ */

#define SCG_RCCR_DIVSLOW_MASK (0xFU)
#define SCG_RCCR_DIVSLOW_SHIFT (0U)
#define SCG_RCCR_DIVSLOW_WIDTH (4U)
#define SCG_RCCR_DIVSLOW(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << SCG_RCCR_DIVSLOW_SHIFT)) & SCG_RCCR_DIVSLOW_MASK)

#define SCG_RCCR_DIVBUS_MASK (0xF0U)
#define SCG_RCCR_DIVBUS_SHIFT (4U)
#define SCG_RCCR_DIVBUS_WIDTH (4U)
#define SCG_RCCR_DIVBUS(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << SCG_RCCR_DIVBUS_SHIFT)) & SCG_RCCR_DIVBUS_MASK)

#define SCG_RCCR_DIVCORE_MASK (0xF0000U)
#define SCG_RCCR_DIVCORE_SHIFT (16U)
#define SCG_RCCR_DIVCORE_WIDTH (4U)
#define SCG_RCCR_DIVCORE(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << SCG_RCCR_DIVCORE_SHIFT)) & SCG_RCCR_DIVCORE_MASK)

#define SCG_RCCR_SCS_MASK (0xF000000U)
#define SCG_RCCR_SCS_SHIFT (24U)
#define SCG_RCCR_SCS_WIDTH (4U)
#define SCG_RCCR_SCS(x) (((uint32_t)(((uint32_t)(x)) << SCG_RCCR_SCS_SHIFT)) & SCG_RCCR_SCS_MASK)
/*! @} */

/*! @name VCCR - VLPR Clock Control Register */
/*! @{ */

#define SCG_VCCR_DIVSLOW_MASK (0xFU)
#define SCG_VCCR_DIVSLOW_SHIFT (0U)
#define SCG_VCCR_DIVSLOW_WIDTH (4U)
#define SCG_VCCR_DIVSLOW(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << SCG_VCCR_DIVSLOW_SHIFT)) & SCG_VCCR_DIVSLOW_MASK)

#define SCG_VCCR_DIVBUS_MASK (0xF0U)
#define SCG_VCCR_DIVBUS_SHIFT (4U)
#define SCG_VCCR_DIVBUS_WIDTH (4U)
#define SCG_VCCR_DIVBUS(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << SCG_VCCR_DIVBUS_SHIFT)) & SCG_VCCR_DIVBUS_MASK)

#define SCG_VCCR_DIVCORE_MASK (0xF0000U)
#define SCG_VCCR_DIVCORE_SHIFT (16U)
#define SCG_VCCR_DIVCORE_WIDTH (4U)
#define SCG_VCCR_DIVCORE(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << SCG_VCCR_DIVCORE_SHIFT)) & SCG_VCCR_DIVCORE_MASK)

#define SCG_VCCR_SCS_MASK (0xF000000U)
#define SCG_VCCR_SCS_SHIFT (24U)
#define SCG_VCCR_SCS_WIDTH (4U)
#define SCG_VCCR_SCS(x) (((uint32_t)(((uint32_t)(x)) << SCG_VCCR_SCS_SHIFT)) & SCG_VCCR_SCS_MASK)
/*! @} */

/*! @name CLKOUTCNFG - SCG CLKOUT Configuration Register */
/*! @{ */

#define SCG_CLKOUTCNFG_CLKOUTSEL_MASK (0xF000000U)
#define SCG_CLKOUTCNFG_CLKOUTSEL_SHIFT (24U)
#define SCG_CLKOUTCNFG_CLKOUTSEL_WIDTH (4U)
#define SCG_CLKOUTCNFG_CLKOUTSEL(x)                                                                \
    (((uint32_t)(((uint32_t)(x)) << SCG_CLKOUTCNFG_CLKOUTSEL_SHIFT)) &                             \
     SCG_CLKOUTCNFG_CLKOUTSEL_MASK)
/*! @} */

/*! @name SOSCCSR - System OSC Control Status Register */
/*! @{ */

#define SCG_SOSCCSR_SOSCEN_MASK (0x1U)
#define SCG_SOSCCSR_SOSCEN_SHIFT (0U)
#define SCG_SOSCCSR_SOSCEN_WIDTH (1U)
#define SCG_SOSCCSR_SOSCEN(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << SCG_SOSCCSR_SOSCEN_SHIFT)) & SCG_SOSCCSR_SOSCEN_MASK)

#define SCG_SOSCCSR_SOSCCM_MASK (0x10000U)
#define SCG_SOSCCSR_SOSCCM_SHIFT (16U)
#define SCG_SOSCCSR_SOSCCM_WIDTH (1U)
#define SCG_SOSCCSR_SOSCCM(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << SCG_SOSCCSR_SOSCCM_SHIFT)) & SCG_SOSCCSR_SOSCCM_MASK)

#define SCG_SOSCCSR_SOSCCMRE_MASK (0x20000U)
#define SCG_SOSCCSR_SOSCCMRE_SHIFT (17U)
#define SCG_SOSCCSR_SOSCCMRE_WIDTH (1U)
#define SCG_SOSCCSR_SOSCCMRE(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << SCG_SOSCCSR_SOSCCMRE_SHIFT)) & SCG_SOSCCSR_SOSCCMRE_MASK)

#define SCG_SOSCCSR_LK_MASK (0x800000U)
#define SCG_SOSCCSR_LK_SHIFT (23U)
#define SCG_SOSCCSR_LK_WIDTH (1U)
#define SCG_SOSCCSR_LK(x)                                                                          \
    (((uint32_t)(((uint32_t)(x)) << SCG_SOSCCSR_LK_SHIFT)) & SCG_SOSCCSR_LK_MASK)

#define SCG_SOSCCSR_SOSCVLD_MASK (0x1000000U)
#define SCG_SOSCCSR_SOSCVLD_SHIFT (24U)
#define SCG_SOSCCSR_SOSCVLD_WIDTH (1U)
#define SCG_SOSCCSR_SOSCVLD(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << SCG_SOSCCSR_SOSCVLD_SHIFT)) & SCG_SOSCCSR_SOSCVLD_MASK)

#define SCG_SOSCCSR_SOSCSEL_MASK (0x2000000U)
#define SCG_SOSCCSR_SOSCSEL_SHIFT (25U)
#define SCG_SOSCCSR_SOSCSEL_WIDTH (1U)
#define SCG_SOSCCSR_SOSCSEL(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << SCG_SOSCCSR_SOSCSEL_SHIFT)) & SCG_SOSCCSR_SOSCSEL_MASK)

#define SCG_SOSCCSR_SOSCERR_MASK (0x4000000U)
#define SCG_SOSCCSR_SOSCERR_SHIFT (26U)
#define SCG_SOSCCSR_SOSCERR_WIDTH (1U)
#define SCG_SOSCCSR_SOSCERR(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << SCG_SOSCCSR_SOSCERR_SHIFT)) & SCG_SOSCCSR_SOSCERR_MASK)
/*! @} */

/*! @name SOSCDIV - System OSC Divide Register */
/*! @{ */

