rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_SCG.h
#define SCG_SOSCDIV_SOSCDIV1_MASK (0x7U)
#define SCG_SOSCDIV_SOSCDIV1_SHIFT (0U)
#define SCG_SOSCDIV_SOSCDIV1_WIDTH (3U)
#define SCG_SOSCDIV_SOSCDIV1(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << SCG_SOSCDIV_SOSCDIV1_SHIFT)) & SCG_SOSCDIV_SOSCDIV1_MASK)

#define SCG_SOSCDIV_SOSCDIV2_MASK (0x700U)
#define SCG_SOSCDIV_SOSCDIV2_SHIFT (8U)
#define SCG_SOSCDIV_SOSCDIV2_WIDTH (3U)
#define SCG_SOSCDIV_SOSCDIV2(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << SCG_SOSCDIV_SOSCDIV2_SHIFT)) & SCG_SOSCDIV_SOSCDIV2_MASK)
/*! @} */

/*! @name SOSCCFG - System Oscillator Configuration Register */
/*! @{ */

#define SCG_SOSCCFG_EREFS_MASK (0x4U)
#define SCG_SOSCCFG_EREFS_SHIFT (2U)
#define SCG_SOSCCFG_EREFS_WIDTH (1U)
#define SCG_SOSCCFG_EREFS(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << SCG_SOSCCFG_EREFS_SHIFT)) & SCG_SOSCCFG_EREFS_MASK)

#define SCG_SOSCCFG_HGO_MASK (0x8U)
#define SCG_SOSCCFG_HGO_SHIFT (3U)
#define SCG_SOSCCFG_HGO_WIDTH (1U)
#define SCG_SOSCCFG_HGO(x)                                                                         \
    (((uint32_t)(((uint32_t)(x)) << SCG_SOSCCFG_HGO_SHIFT)) & SCG_SOSCCFG_HGO_MASK)

#define SCG_SOSCCFG_RANGE_MASK (0x30U)
#define SCG_SOSCCFG_RANGE_SHIFT (4U)
#define SCG_SOSCCFG_RANGE_WIDTH (2U)
#define SCG_SOSCCFG_RANGE(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << SCG_SOSCCFG_RANGE_SHIFT)) & SCG_SOSCCFG_RANGE_MASK)
/*! @} */

/*! @name SIRCCSR - Slow IRC Control Status Register */
/*! @{ */

#define SCG_SIRCCSR_SIRCEN_MASK (0x1U)
#define SCG_SIRCCSR_SIRCEN_SHIFT (0U)
#define SCG_SIRCCSR_SIRCEN_WIDTH (1U)
#define SCG_SIRCCSR_SIRCEN(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << SCG_SIRCCSR_SIRCEN_SHIFT)) & SCG_SIRCCSR_SIRCEN_MASK)

#define SCG_SIRCCSR_SIRCSTEN_MASK (0x2U)
#define SCG_SIRCCSR_SIRCSTEN_SHIFT (1U)
#define SCG_SIRCCSR_SIRCSTEN_WIDTH (1U)
#define SCG_SIRCCSR_SIRCSTEN(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << SCG_SIRCCSR_SIRCSTEN_SHIFT)) & SCG_SIRCCSR_SIRCSTEN_MASK)

#define SCG_SIRCCSR_SIRCLPEN_MASK (0x4U)
#define SCG_SIRCCSR_SIRCLPEN_SHIFT (2U)
#define SCG_SIRCCSR_SIRCLPEN_WIDTH (1U)
#define SCG_SIRCCSR_SIRCLPEN(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << SCG_SIRCCSR_SIRCLPEN_SHIFT)) & SCG_SIRCCSR_SIRCLPEN_MASK)

#define SCG_SIRCCSR_LK_MASK (0x800000U)
#define SCG_SIRCCSR_LK_SHIFT (23U)
#define SCG_SIRCCSR_LK_WIDTH (1U)
#define SCG_SIRCCSR_LK(x)                                                                          \
    (((uint32_t)(((uint32_t)(x)) << SCG_SIRCCSR_LK_SHIFT)) & SCG_SIRCCSR_LK_MASK)

#define SCG_SIRCCSR_SIRCVLD_MASK (0x1000000U)
#define SCG_SIRCCSR_SIRCVLD_SHIFT (24U)
#define SCG_SIRCCSR_SIRCVLD_WIDTH (1U)
#define SCG_SIRCCSR_SIRCVLD(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << SCG_SIRCCSR_SIRCVLD_SHIFT)) & SCG_SIRCCSR_SIRCVLD_MASK)

#define SCG_SIRCCSR_SIRCSEL_MASK (0x2000000U)
#define SCG_SIRCCSR_SIRCSEL_SHIFT (25U)
#define SCG_SIRCCSR_SIRCSEL_WIDTH (1U)
#define SCG_SIRCCSR_SIRCSEL(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << SCG_SIRCCSR_SIRCSEL_SHIFT)) & SCG_SIRCCSR_SIRCSEL_MASK)
/*! @} */

/*! @name SIRCDIV - Slow IRC Divide Register */
/*! @{ */

#define SCG_SIRCDIV_SIRCDIV1_MASK (0x7U)
#define SCG_SIRCDIV_SIRCDIV1_SHIFT (0U)
#define SCG_SIRCDIV_SIRCDIV1_WIDTH (3U)
#define SCG_SIRCDIV_SIRCDIV1(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << SCG_SIRCDIV_SIRCDIV1_SHIFT)) & SCG_SIRCDIV_SIRCDIV1_MASK)

#define SCG_SIRCDIV_SIRCDIV2_MASK (0x700U)
#define SCG_SIRCDIV_SIRCDIV2_SHIFT (8U)
#define SCG_SIRCDIV_SIRCDIV2_WIDTH (3U)
#define SCG_SIRCDIV_SIRCDIV2(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << SCG_SIRCDIV_SIRCDIV2_SHIFT)) & SCG_SIRCDIV_SIRCDIV2_MASK)
/*! @} */

/*! @name SIRCCFG - Slow IRC Configuration Register */
/*! @{ */

#define SCG_SIRCCFG_RANGE_MASK (0x1U)
#define SCG_SIRCCFG_RANGE_SHIFT (0U)
#define SCG_SIRCCFG_RANGE_WIDTH (1U)
#define SCG_SIRCCFG_RANGE(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << SCG_SIRCCFG_RANGE_SHIFT)) & SCG_SIRCCFG_RANGE_MASK)
/*! @} */

/*! @name FIRCCSR - Fast IRC Control Status Register */
/*! @{ */

#define SCG_FIRCCSR_FIRCEN_MASK (0x1U)
#define SCG_FIRCCSR_FIRCEN_SHIFT (0U)
#define SCG_FIRCCSR_FIRCEN_WIDTH (1U)
#define SCG_FIRCCSR_FIRCEN(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << SCG_FIRCCSR_FIRCEN_SHIFT)) & SCG_FIRCCSR_FIRCEN_MASK)

#define SCG_FIRCCSR_FIRCREGOFF_MASK (0x8U)
#define SCG_FIRCCSR_FIRCREGOFF_SHIFT (3U)
#define SCG_FIRCCSR_FIRCREGOFF_WIDTH (1U)
#define SCG_FIRCCSR_FIRCREGOFF(x)                                                                  \
    (((uint32_t)(((uint32_t)(x)) << SCG_FIRCCSR_FIRCREGOFF_SHIFT)) & SCG_FIRCCSR_FIRCREGOFF_MASK)

#define SCG_FIRCCSR_LK_MASK (0x800000U)
#define SCG_FIRCCSR_LK_SHIFT (23U)
#define SCG_FIRCCSR_LK_WIDTH (1U)
#define SCG_FIRCCSR_LK(x)                                                                          \
    (((uint32_t)(((uint32_t)(x)) << SCG_FIRCCSR_LK_SHIFT)) & SCG_FIRCCSR_LK_MASK)

#define SCG_FIRCCSR_FIRCVLD_MASK (0x1000000U)
#define SCG_FIRCCSR_FIRCVLD_SHIFT (24U)
#define SCG_FIRCCSR_FIRCVLD_WIDTH (1U)
#define SCG_FIRCCSR_FIRCVLD(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << SCG_FIRCCSR_FIRCVLD_SHIFT)) & SCG_FIRCCSR_FIRCVLD_MASK)

#define SCG_FIRCCSR_FIRCSEL_MASK (0x2000000U)
#define SCG_FIRCCSR_FIRCSEL_SHIFT (25U)
#define SCG_FIRCCSR_FIRCSEL_WIDTH (1U)
#define SCG_FIRCCSR_FIRCSEL(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << SCG_FIRCCSR_FIRCSEL_SHIFT)) & SCG_FIRCCSR_FIRCSEL_MASK)

#define SCG_FIRCCSR_FIRCERR_MASK (0x4000000U)
#define SCG_FIRCCSR_FIRCERR_SHIFT (26U)
#define SCG_FIRCCSR_FIRCERR_WIDTH (1U)
#define SCG_FIRCCSR_FIRCERR(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << SCG_FIRCCSR_FIRCERR_SHIFT)) & SCG_FIRCCSR_FIRCERR_MASK)
/*! @} */

/*! @name FIRCDIV - Fast IRC Divide Register */
/*! @{ */

#define SCG_FIRCDIV_FIRCDIV1_MASK (0x7U)
#define SCG_FIRCDIV_FIRCDIV1_SHIFT (0U)
#define SCG_FIRCDIV_FIRCDIV1_WIDTH (3U)
#define SCG_FIRCDIV_FIRCDIV1(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << SCG_FIRCDIV_FIRCDIV1_SHIFT)) & SCG_FIRCDIV_FIRCDIV1_MASK)

#define SCG_FIRCDIV_FIRCDIV2_MASK (0x700U)
#define SCG_FIRCDIV_FIRCDIV2_SHIFT (8U)
#define SCG_FIRCDIV_FIRCDIV2_WIDTH (3U)
#define SCG_FIRCDIV_FIRCDIV2(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << SCG_FIRCDIV_FIRCDIV2_SHIFT)) & SCG_FIRCDIV_FIRCDIV2_MASK)
/*! @} */

/*! @name FIRCCFG - Fast IRC Configuration Register */
/*! @{ */

#define SCG_FIRCCFG_RANGE_MASK (0x3U)
#define SCG_FIRCCFG_RANGE_SHIFT (0U)
#define SCG_FIRCCFG_RANGE_WIDTH (2U)
#define SCG_FIRCCFG_RANGE(x)                                                                       \
    (((uint32_t)(((uint32_t)(x)) << SCG_FIRCCFG_RANGE_SHIFT)) & SCG_FIRCCFG_RANGE_MASK)
/*! @} */

/*! @name SPLLCSR - System PLL Control Status Register */
/*! @{ */

