rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_SCG.h
#define SCG_SPLLCSR_SPLLEN_MASK (0x1U)
#define SCG_SPLLCSR_SPLLEN_SHIFT (0U)
#define SCG_SPLLCSR_SPLLEN_WIDTH (1U)
#define SCG_SPLLCSR_SPLLEN(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << SCG_SPLLCSR_SPLLEN_SHIFT)) & SCG_SPLLCSR_SPLLEN_MASK)

#define SCG_SPLLCSR_SPLLCM_MASK (0x10000U)
#define SCG_SPLLCSR_SPLLCM_SHIFT (16U)
#define SCG_SPLLCSR_SPLLCM_WIDTH (1U)
#define SCG_SPLLCSR_SPLLCM(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << SCG_SPLLCSR_SPLLCM_SHIFT)) & SCG_SPLLCSR_SPLLCM_MASK)

#define SCG_SPLLCSR_SPLLCMRE_MASK (0x20000U)
#define SCG_SPLLCSR_SPLLCMRE_SHIFT (17U)
#define SCG_SPLLCSR_SPLLCMRE_WIDTH (1U)
#define SCG_SPLLCSR_SPLLCMRE(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << SCG_SPLLCSR_SPLLCMRE_SHIFT)) & SCG_SPLLCSR_SPLLCMRE_MASK)

#define SCG_SPLLCSR_LK_MASK (0x800000U)
#define SCG_SPLLCSR_LK_SHIFT (23U)
#define SCG_SPLLCSR_LK_WIDTH (1U)
#define SCG_SPLLCSR_LK(x)                                                                          \
    (((uint32_t)(((uint32_t)(x)) << SCG_SPLLCSR_LK_SHIFT)) & SCG_SPLLCSR_LK_MASK)

#define SCG_SPLLCSR_SPLLVLD_MASK (0x1000000U)
#define SCG_SPLLCSR_SPLLVLD_SHIFT (24U)
#define SCG_SPLLCSR_SPLLVLD_WIDTH (1U)
#define SCG_SPLLCSR_SPLLVLD(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << SCG_SPLLCSR_SPLLVLD_SHIFT)) & SCG_SPLLCSR_SPLLVLD_MASK)

#define SCG_SPLLCSR_SPLLSEL_MASK (0x2000000U)
#define SCG_SPLLCSR_SPLLSEL_SHIFT (25U)
#define SCG_SPLLCSR_SPLLSEL_WIDTH (1U)
#define SCG_SPLLCSR_SPLLSEL(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << SCG_SPLLCSR_SPLLSEL_SHIFT)) & SCG_SPLLCSR_SPLLSEL_MASK)

#define SCG_SPLLCSR_SPLLERR_MASK (0x4000000U)
#define SCG_SPLLCSR_SPLLERR_SHIFT (26U)
#define SCG_SPLLCSR_SPLLERR_WIDTH (1U)
#define SCG_SPLLCSR_SPLLERR(x)                                                                     \
    (((uint32_t)(((uint32_t)(x)) << SCG_SPLLCSR_SPLLERR_SHIFT)) & SCG_SPLLCSR_SPLLERR_MASK)
/*! @} */

/*! @name SPLLDIV - System PLL Divide Register */
/*! @{ */

#define SCG_SPLLDIV_SPLLDIV1_MASK (0x7U)
#define SCG_SPLLDIV_SPLLDIV1_SHIFT (0U)
#define SCG_SPLLDIV_SPLLDIV1_WIDTH (3U)
#define SCG_SPLLDIV_SPLLDIV1(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << SCG_SPLLDIV_SPLLDIV1_SHIFT)) & SCG_SPLLDIV_SPLLDIV1_MASK)

#define SCG_SPLLDIV_SPLLDIV2_MASK (0x700U)
#define SCG_SPLLDIV_SPLLDIV2_SHIFT (8U)
#define SCG_SPLLDIV_SPLLDIV2_WIDTH (3U)
#define SCG_SPLLDIV_SPLLDIV2(x)                                                                    \
    (((uint32_t)(((uint32_t)(x)) << SCG_SPLLDIV_SPLLDIV2_SHIFT)) & SCG_SPLLDIV_SPLLDIV2_MASK)
/*! @} */

/*! @name SPLLCFG - System PLL Configuration Register */
/*! @{ */

#define SCG_SPLLCFG_SOURCE_MASK (0x1U)
#define SCG_SPLLCFG_SOURCE_SHIFT (0U)
#define SCG_SPLLCFG_SOURCE_WIDTH (1U)
#define SCG_SPLLCFG_SOURCE(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << SCG_SPLLCFG_SOURCE_SHIFT)) & SCG_SPLLCFG_SOURCE_MASK)

#define SCG_SPLLCFG_PREDIV_MASK (0x700U)
#define SCG_SPLLCFG_PREDIV_SHIFT (8U)
#define SCG_SPLLCFG_PREDIV_WIDTH (3U)
#define SCG_SPLLCFG_PREDIV(x)                                                                      \
    (((uint32_t)(((uint32_t)(x)) << SCG_SPLLCFG_PREDIV_SHIFT)) & SCG_SPLLCFG_PREDIV_MASK)

#define SCG_SPLLCFG_MULT_MASK (0x1F0000U)
#define SCG_SPLLCFG_MULT_SHIFT (16U)
#define SCG_SPLLCFG_MULT_WIDTH (5U)
#define SCG_SPLLCFG_MULT(x)                                                                        \
    (((uint32_t)(((uint32_t)(x)) << SCG_SPLLCFG_MULT_SHIFT)) & SCG_SPLLCFG_MULT_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group SCG_Register_Masks */

/*!
 * @}
 */ /* end of group SCG_Peripheral_Access_Layer */

#endif /* #if !defined(S32M24x_SCG_H_) */
